Tekla Open API Reference for Tekla Structures 2025
Constants Class
 The Constants class is a repository for constants used by the Tekla.Structures.Datatype.* types.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Datatype.Constants
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static class Constants
Public NotInheritable Class Constants
The Constants type exposes the following members.
Fields
Name | Description
XS_DEFAULT
 The value of an uninitialized Tekla Structures variable.
Top
See Also
Reference
Tekla.Structures.Datatype Namespace